Backend/app/controllers/registrations_controller.rb

    def create
        user = User.create(
            id: Rails.application.credentials.twilio[:phone_number]
            name: params[:name],
            email: params[:email],
            password: params[:password],
            username: params[:username],
            phone: Rails.application.credentials.twilio[:phone_number]
        )
---
INSERT INTO "users" ("name", "username", "email", "password_digest", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)