Backend/app/controllers/texts_controller.rb

  def index
    phone = Rails.application.credentials.twilio[:phone_number].to_s.prepend("+")
    @texts = Text.where(to: phone).or(Text.where(from: phone))
---
SELECT "texts".* FROM "texts" WHERE "texts"."to" = ?  [["to", "12057079943"]]

  def create
    if params['SmsStatus'] == "received"
      @text = Text.new(
        body: params['Body'],
        sid: params['SmsSid'],
        account_sid: params['AccountSid'],
        messaging_service_sid: params['MessagingServiceSid'],
        to: params['To'],
        from: params['From'],
        direction: 'Incoming',
        user_id: User.find_by(phone: params['To'].remove("+")).id
      )
    else
      response = TwilioClient.new.send_text(params[:phone], params[:body])
      @text = Text.new(
        body: params[:body],
        sid: response.sid,
        account_sid: response.account_sid,
        messaging_service_sid: response.messaging_service_sid,
        to: response.to,
        from: response.from,
        direction: response.direction,
        user_id: params[:user]
      )
    end

    if @text.save
---
SELECT "users".* FROM "users" WHERE "users"."phone" = ? LIMIT ?  [["phone", "12057079943"], ["LIMIT", 1]]
INSERT INTO "texts" ("body", "messaging_service_sid", "to", "from", "direction", "sid", "account_sid", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_text
      @text = Text.find(params[:id])
---
SELECT "texts".* FROM "texts" WHERE "texts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]