Backend/app/controllers/texts_controller.rb

SELECT "texts".* FROM "texts"
---
  def index
    @texts = Text.all